{
  "add_cross_attention": false,
  "architectures": [
    "BiomedBERTWithCRF"
  ],
  "attention_probs_dropout_prob": 0.1,
  "auto_map": {
    "AutoModelForTokenClassification": "modeling_biomedbert_crf.BiomedBERTWithCRF"
  },
  "bos_token_id": null,
  "classifier_dropout": null,
  "eos_token_id": null,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "T001",
    "1": "T002",
    "2": "T004",
    "3": "T005",
    "4": "T007",
    "5": "T008",
    "6": "T010",
    "7": "T011",
    "8": "T012",
    "9": "T013",
    "10": "T014",
    "11": "T015",
    "12": "T016",
    "13": "T017",
    "14": "T018",
    "15": "T019",
    "16": "T020",
    "17": "T021",
    "18": "T022",
    "19": "T023",
    "20": "T024",
    "21": "T025",
    "22": "T026",
    "23": "T028",
    "24": "T029",
    "25": "T030",
    "26": "T031",
    "27": "T032",
    "28": "T033",
    "29": "T034",
    "30": "T037",
    "31": "T038",
    "32": "T039",
    "33": "T040",
    "34": "T041",
    "35": "T042",
    "36": "T043",
    "37": "T044",
    "38": "T045",
    "39": "T046",
    "40": "T047",
    "41": "T048",
    "42": "T049",
    "43": "T050",
    "44": "T051",
    "45": "T052",
    "46": "T053",
    "47": "T054",
    "48": "T055",
    "49": "T056",
    "50": "T057",
    "51": "T058",
    "52": "T059",
    "53": "T060",
    "54": "T061",
    "55": "T062",
    "56": "T063",
    "57": "T064",
    "58": "T065",
    "59": "T066",
    "60": "T067",
    "61": "T068",
    "62": "T069",
    "63": "T070",
    "64": "T071",
    "65": "T072",
    "66": "T073",
    "67": "T074",
    "68": "T075",
    "69": "T077",
    "70": "T078",
    "71": "T079",
    "72": "T080",
    "73": "T081",
    "74": "T082",
    "75": "T083",
    "76": "T085",
    "77": "T086",
    "78": "T087",
    "79": "T088",
    "80": "T089",
    "81": "T090",
    "82": "T091",
    "83": "T092",
    "84": "T093",
    "85": "T094",
    "86": "T095",
    "87": "T096",
    "88": "T097",
    "89": "T098",
    "90": "T099",
    "91": "T100",
    "92": "T101",
    "93": "T102",
    "94": "T103",
    "95": "T104",
    "96": "T109",
    "97": "T114",
    "98": "T116",
    "99": "T120",
    "100": "T121",
    "101": "T122",
    "102": "T123",
    "103": "T125",
    "104": "T126",
    "105": "T127",
    "106": "T129",
    "107": "T130",
    "108": "T131",
    "109": "T167",
    "110": "T168",
    "111": "T169",
    "112": "T170",
    "113": "T171",
    "114": "T184",
    "115": "T185",
    "116": "T190",
    "117": "T191",
    "118": "T192",
    "119": "T194",
    "120": "T195",
    "121": "T196",
    "122": "T197",
    "123": "T200",
    "124": "T201",
    "125": "T203",
    "126": "T204"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "is_decoder": false,
  "label2id": {
    "T001": 0,
    "T002": 1,
    "T004": 2,
    "T005": 3,
    "T007": 4,
    "T008": 5,
    "T010": 6,
    "T011": 7,
    "T012": 8,
    "T013": 9,
    "T014": 10,
    "T015": 11,
    "T016": 12,
    "T017": 13,
    "T018": 14,
    "T019": 15,
    "T020": 16,
    "T021": 17,
    "T022": 18,
    "T023": 19,
    "T024": 20,
    "T025": 21,
    "T026": 22,
    "T028": 23,
    "T029": 24,
    "T030": 25,
    "T031": 26,
    "T032": 27,
    "T033": 28,
    "T034": 29,
    "T037": 30,
    "T038": 31,
    "T039": 32,
    "T040": 33,
    "T041": 34,
    "T042": 35,
    "T043": 36,
    "T044": 37,
    "T045": 38,
    "T046": 39,
    "T047": 40,
    "T048": 41,
    "T049": 42,
    "T050": 43,
    "T051": 44,
    "T052": 45,
    "T053": 46,
    "T054": 47,
    "T055": 48,
    "T056": 49,
    "T057": 50,
    "T058": 51,
    "T059": 52,
    "T060": 53,
    "T061": 54,
    "T062": 55,
    "T063": 56,
    "T064": 57,
    "T065": 58,
    "T066": 59,
    "T067": 60,
    "T068": 61,
    "T069": 62,
    "T070": 63,
    "T071": 64,
    "T072": 65,
    "T073": 66,
    "T074": 67,
    "T075": 68,
    "T077": 69,
    "T078": 70,
    "T079": 71,
    "T080": 72,
    "T081": 73,
    "T082": 74,
    "T083": 75,
    "T085": 76,
    "T086": 77,
    "T087": 78,
    "T088": 79,
    "T089": 80,
    "T090": 81,
    "T091": 82,
    "T092": 83,
    "T093": 84,
    "T094": 85,
    "T095": 86,
    "T096": 87,
    "T097": 88,
    "T098": 89,
    "T099": 90,
    "T100": 91,
    "T101": 92,
    "T102": 93,
    "T103": 94,
    "T104": 95,
    "T109": 96,
    "T114": 97,
    "T116": 98,
    "T120": 99,
    "T121": 100,
    "T122": 101,
    "T123": 102,
    "T125": 103,
    "T126": 104,
    "T127": 105,
    "T129": 106,
    "T130": 107,
    "T131": 108,
    "T167": 109,
    "T168": 110,
    "T169": 111,
    "T170": 112,
    "T171": 113,
    "T184": 114,
    "T185": 115,
    "T190": 116,
    "T191": 117,
    "T192": 118,
    "T194": 119,
    "T195": 120,
    "T196": 121,
    "T197": 122,
    "T200": 123,
    "T201": 124,
    "T203": 125,
    "T204": 126
  },
  
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "tie_word_embeddings": true,
  "transformers_version": "5.7.0",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 30522
  
}
